Repository: xperseguers/t3ext-image_autoresize
Catalog: Resources/Private/Language/*.locallang_csh_flexform.xlf
Languages: da

# title.description
source: Title of the rule set. This is only used in this form to help you keep your rule sets organized.
da: Titel for regelsæt. Dette anvendes kun for denne formular for at hjælpe dig med at holde dine regelsæt organiserede.

# usergroup.description
source: Set of backend user groups to which the rule set should be applied. May be left empty.
da: Sæt af backend-brugergrupper for hvilke regelsættene skal gælde for. Kan efterlades tom.

# directories.description
source: Comma-separated list of directories to be monitored. Example: fileadmin/ If empty, the list of directories configured in General tab will be taken into account. Wildcards are supported: fileadmin/*/images/ fileadmin/**/images/
da: Komma-separeret liste af kataloger som skal overvåges. Eksempel: fileadmin/ Hvis tom vil listen af kataloger som er konfigureret i fanen Generelt blive taget i betragtning. Jokertegn understøttes: fileadmin/*/billeder/ fileadmin/**/billeder

# file_types.description
source: Comma-separated list of file types to be handled. Example: jpg,jpeg,png,tif,tiff If empty, the list of file types configured in General tab will be taken into account.
da: Komma-separeret liste af filtyper som skal overvåges. Eksempel: jpg,jpeg,png,tif,tiff Hvis tom vil listen af filtyper som er konfigureret i fanen Generelt blive taget i brug.

# threshold.description
source: Images with a file size larger than this value will be resized (allowed units: B|K|M). If empty, the threshold configured in General tab will be taken into account.
da: Billeder større end denne værdi vil få ændret størrelse (tilladte enheder: B|K|M). Hvis tom, så vil grænsen som er konfigureret i fanen Generelt blive taget i brug.

# max_width.description
source: Images will be resized up to this maximum width. If empty, the maximum width configured in General tab will be taken into account.
da: Billeder vil få ændret størrelse op til denne maksimale bredde. Hvis tom, så vil den maksimale bredde som er konfigureret i fanen Generelt blive taget i brug.

# max_height.description
source: Images will be resized up to this maximum height. If empty, the maximum height configured in General tab will be taken into account.
da: Billeder vil få ændret størrelse op til denne maksimale højde. Hvis tom, så vil den maksimale højde som er konfigureret i fanen Generelt blive taget i brug.

# max_size.description
source: Images will be resized up to this maximum size. Example: 8M (for a maximum image size of 8 megapixels) If empty, the maximum size configured in General tab will be taken into account.
da: Billeder vil blive ændret op til denne maksimale størrelse. Eksempel: 8M (for en maksimal billedstørrelse på 8 megapixels) Hvis tom vil den maksimale størrelse konfigureret i fanen Generelt, blive taget i betragtning.

# keep_metadata.description
source: Either inherit configuration from General settings or explicitly configure whether to keep/strip off color profile and metadata such as EXIF, IPTC and XMP.
da: Enten nedarv konfiguration fra indstillinger i Generelt eller konfigurér eksplicit hvorvidt farveprofiler og metadata som EXIF, IPTC og XMP skal bevares/fjernes.

# conversion_mapping.description
source: Comma-separated list of conversion mapping instructions. This lets you automatically convert the type of the image while resizing it. If empty, the conversion mapping instructions configured in Options tab will be taken into account.
da: Komma-separeret liste over instruktioner for konverterings-kortlægning. Dette lader dig konvertere billedetypen automatisk, mens størrelse ændres. Hvis tom, så vil konverterings-kortlægningsinstruktionerne som er konfigureret i fanen Tilvalg blive taget i brug.
