Repository: xperseguers/t3ext-image_autoresize
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: da

source: Save configuration
da: Gem konfiguration

# saveCloseConfiguration
source: Save and close configuration
da: Gem og luk konfiguration

source: Close configuration
da: Luk konfiguration

# extension.bmp
source: .bmp - Windows OS/2 Bitmap Graphics
da: .bmp - Windows OS/2 bitmap Grafik

# extension.gif
source: .gif - Graphic Interchange Format
da: .gif - Graphics Interchange Format

# extension.jpg
source: .jpg - JPEG/JIFF Image
da: .jpg - JPEG/JIFF-billede

# extension.jpeg
source: .jpeg - JPEG/JIFF Image
da: .jpeg - JPEG/JIFF-billede

# extension.pcx
source: .pcx - Paintbrush Bitmap Graphic
da: .pcx - Paintbrush bitmap grafik

# extension.tga
source: .tga - Truevision Targa Graphic
da: .tga - Truevision Targa grafik

# message.imageTransparent
source: Image %s has not been resized because transparency has been detected.
da: Billede %s er ikke blevet skaleret fordi transparency er detektet.

# message.imageAnimated
source: Image %s has not been resized because it is an animated GIF.
da: Billede %s fik ikke ændret størrelse da det er en animeret GIF.

# message.imageResized
source: Image %s has been automatically resized to %s×%s pixels.
da: Billede %s er automatisk blevet skaleret til %s×%s pixels.

# message.imageResizedAndRenamed
source: Image %s has been automatically resized to %s×%s pixels and has been renamed as %s.
da: Billede %s er automatisk blevet ændret til %s×%s pixels og er blevet omdøbt til %s.

# message.imageNotWritable
source: Image %s cannot be resized because file is not writable.
da: Billede %s kan ikke ændres i størrelse da det er skrivebeskyttet.

# message.cannotResize
source: Image could not get resized since ImageMagick or GraphicsMagick seems to be configured incorrectly.
da: Billedet kunne ikke blive skaleret eftersom ImageMagick eller GraphicsMagick synes at være konfigureret forkert.
