Repository: xperseguers/t3ext-image_autoresize
Catalog: Resources/Private/Language/*.locallang_tca.xlf
Languages: da, de, es, fr, it

# tx_imageautoresize.directories
source: Directories
da: Mapper
de: Verzeichnisse
es: Directorios
fr: Répertoires
it: Cartelle

# tx_imageautoresize.directories.description
source: Comma-separated list of directories to be monitored. Example: 1:/ (for fileadmin/) Wildcards are supported: 1:/*/images/ 1:/**/images/
da: Komma-separeret liste af kataloger som skal overvåges. Eksempel: 1:/ (for fileadmin/) Jokertegn understøttes: 1:/*/billeder/ 1:/**/billeder/
de: Durch Kommata getrennte Liste der zu überwachenden Verzeichnisse. Beispiel: 1:/ (für fileadmin/) Wildcards werden unterstützt: 1:/*/images/ 1:/**/images/
es: Lista separada por comas de los directorios que deben supervisarse. Ejemplo: 1:/ (para fileadmin/) Se admiten comodines: 1:/*/imagenes/ 1:/**/imagenes/
fr: Liste de répertoires à surveiller, séparés par des virgules. Exemple : 1:/ (pour fileadmin/) Les caractères génériques sont pris en charge : 1:/*/images/ 1:/**/images/
it: Elenco separato da virgole delle directory da monitorare. Esempio: 1:/ (per fileadmin/) Sono supportati i caratteri jolly: 1:/*/images/ 1:/**/immagini/

# tx_imageautoresize.file_types
source: Image types
da: Billedtyper
de: Bildtypen
es: Tipos de imágenes
fr: Types d'images
it: Tipi di immagine

# tx_imageautoresize.threshold
source: File size threshold
da: Tærskel til filstørrelse
de: Schwellenwert für die Dateigröße
es: Umbral de tamaño de archivo
fr: Seuil de taille de fichier
it: Soglia di dimensione del file

# tx_imageautoresize.threshold.description
source: Images with a file size larger than this value will be resized (allowed units: B|K|M).
da: Billeder større end denne værdi, vil få ændret størrelse (tilladte enheder: B|K|M).
de: Bilder, deren Dateigröße diesen Wert überschreitet, werden verkleinert (erlaubte Einheiten: B|K|M).
es: Las imágenes con un tamaño de archivo superior a este valor serán redimensionadas (unidades permitidas: B|K|M).
fr: Les images dont la taille de fichier est supérieure à cette valeur seront redimensionnées (unités autorisées : B|K|M).
it: Le immagini con dimensioni superiori a questo valore verranno ridimensionate (unità consentite: B|K|M).

# tx_imageautoresize.max_width
source: Maximum width
da: Maksimal bredde
de: Maximale Breite
es: Anchura máxima
fr: Largeur maximale
it: Larghezza massima

# tx_imageautoresize.max_height
source: Maximum height
da: Maksimal højde
de: Maximale Höhe
es: Altura máxima
fr: Hauteur maximale
it: Altezza massima

# tx_imageautoresize.max_size
source: Maximum image size (pixel area)
da: Maksimale billedstørrelse (pixelareal)
de: Maximale Bildgröße (Pixelbereich)
es: Tamaño máximo de la imagen (área de píxeles)
fr: Taille maximale de l'image (zone de pixels)
it: Dimensione massima dell'immagine (area pixel)

# tx_imageautoresize.max_size.description
source: Images will be resized up to this maximum size. Example: 8M (for 8 megapixels).
da: Billeder vil blive ændret op til denne maksimale størrelse. Eksempel: 8M (for 8 megapixels).
de: Die Bilder werden bis zu dieser Maximalgröße verkleinert. Beispiel: 8M (für 8 Megapixel).
es: Las imágenes se redimensionarán hasta este tamaño máximo. Ejemplo: 8M (para 8 megapíxeles).
fr: Les images seront redimensionnées jusqu'à cette taille maximale. Exemple : 8M (pour 8 mégapixels).
it: Le immagini verranno ridimensionate fino a questa dimensione massima. Esempio: 8M (per 8 megapixel).

# tx_imageautoresize.auto_orient
source: Automatic orientation
da: Automatisk orientering
de: Automatische Ausrichtung
es: Orientación automática
fr: Orientation automatique
it: Orientamento automatico

# tx_imageautoresize.auto_orient.description
source: Will try to auto-magically orient image (useful with photos).
da: Vil forsøge auto-magisk at orientere billede (nyttigt ved fotografier).
de: Versucht, das Bild automatisch auszurichten (nützlich bei Fotos).
es: Intentará orientar la imagen automáticamente (útil con fotos).
fr: Essaie d'orienter automatiquement l'image (utile pour les photos).
it: Tenterà di orientare automaticamente l'immagine (utile con le foto).

# tx_imageautoresize.keep_metadata
source: Keep profile and metadata
da: Behold profil og metadata
de: Profil und Metadaten behalten
es: Mantener perfil y metadatos
fr: Conserver le profil et les métadonnées
it: Mantenere il profilo e i metadati

# tx_imageautoresize.keep_metadata.description
source: If ticked, IM will not use $GLOBALS['TYPO3_CONF_VARS']['GFX']['im_stripProfileCommand'] and thus, color profile and metadata such as EXIF, IPTC and XMP will be kept.
da: Hvis aktiveret vil IM ikke anvende $GLOBALS['TYPO3_CONF_VARS']['GFX']['im_stripProfileCommand'] og således bevares farveprofil og metadata som for eksempel EXIF, IPTC og XMP.
de: Wenn diese Option aktiviert ist, verwendet IM nicht $GLOBALS['TYPO3_CONF_VARS']['GFX']['im_stripProfileCommand'], so dass das Farbprofil und Metadaten wie EXIF, IPTC und XMP erhalten bleiben.
es: Si está marcada, IM no utilizará $GLOBALS['TYPO3_CONF_VARS']['GFX']['im_stripProfileCommand'] y por lo tanto, el perfil de color y metadatos como EXIF, IPTC y XMP se mantendrán.
fr: Si cette case est cochée, IM n'utilisera pas $GLOBALS['TYPO3_CONF_VARS']['GFX']['im_stripProfileCommand'] et ainsi, le profil de couleur et les métadonnées telles que EXIF, IPTC et XMP seront conservés.
it: Se questa opzione è selezionata, IM non utilizzerà $GLOBALS['TYPO3_CONF_VARS']['GFX']['im_stripProfileCommand'] e quindi il profilo colore e i metadati come EXIF, IPTC e XMP saranno conservati.

# tx_imageautoresize.keep_metadata.inherit
source: Use general setting
da: Brug generelle indstillinger
de: Standard-Einstellungen benutzen
es: Utilizar la configuración general
fr: Utiliser les paramétrages généraux
it: Usa impostazioni generali

# tx_imageautoresize.keep_metadata.yes
source: Yes
da: Ja
de: Ja
es: Sí
fr: Oui
it: Sì

# tx_imageautoresize.keep_metadata.no
source: No
da: Nej
de: Nein
fr: Non

# tx_imageautoresize.resize_png_with_alpha
source: Resize PNG files with alpha-channel
da: Skalér PNG filer med alpha-channel
de: PNG-Dateien mit Alpha-Kanal skalieren
es: Redimensionar archivos PNG con canal alfa
fr: Redimensionner les fichiers PNG avec un canal alpha
it: Ridimensiona i file PNG con canale alfa

# tx_imageautoresize.resize_png_with_alpha.description
source: If ticked, PNG files with an alpha channel will be resized even though the transparency will be lost.
da: Hvis aktiveret vil PNG-filer med alfa-kanal få ændret størrelsen, selvom tranparency vil gå tabt.
de: Wenn aktiviert, werden PNG-Dateien mit einem Alphakanal verkleinert, obwohl die Transparenz verloren geht.
es: Si está marcada, los archivos PNG con un canal alfa se redimensionarán aunque se pierda la transparencia.
fr: Si cette option est cochée, les fichiers PNG comportant un canal alpha seront redimensionnés même si la transparence est perdue.
it: Se questa opzione è selezionata, i file PNG con un canale alfa verranno ridimensionati anche se la trasparenza andrà persa.

# tx_imageautoresize.conversion_mapping
source: Image type conversion mapping
da: Kortlægning af billedetype-konvertering
de: Zuordnung der Bildtypkonvertierung
es: Asignación de conversión de tipos de imagen
fr: Types de fichiers : tableau de correspondances
it: Mappatura di conversione del tipo di immagine

# tx_imageautoresize.conversion_mapping.description
source: Line-separated list of conversion mapping instructions. This lets you automatically convert the type of the image while resizing it.
da: Linjeadskilt liste over instruktioner til konvertering af mapning. Dette lader dig automatisk konvertere typen af billedet, mens du ændrer størrelse på det.
de: Zeilengetrennte Liste von Zuordnungsanweisungen für die Konvertierung. So können Sie den Bildtyp bei der Größenänderung automatisch konvertieren.
es: Lista separada por líneas de instrucciones de asignación de conversiones. Esto le permite convertir automáticamente el tipo de la imagen mientras la redimensiona.
fr: Liste d'instructions de conversion séparées par des lignes. Cela vous permet de convertir automatiquement le type de l'image lors de son redimensionnement.
it: Elenco separato da righe di istruzioni di mappatura della conversione. Ciò consente di convertire automaticamente il tipo di immagine durante il ridimensionamento.

# tx_imageautoresize.rulesets
source: Rule sets
da: Regelsæt
de: Regeln
es: Conjuntos de reglas
fr: Réglages prédéfinis
it: Set di regole

# tx_imageautoresize.rulesets.description
source: You may define as many rule sets as you wish. They will be evaluated one after the other in order to possibly override general settings. The evalutation stops as soon as a matching rule set has been found.
da: Du kan definere så mange regelsæt du ønsker. De vil blive evalueret en efter en for om muligt, at tilsidesætte generelle indstillinger. Evalueringen stopper så snart et matchende regelsæt bliver fundet.
de: Sie können so viele Regelsätze definieren, wie Sie möchten. Sie werden nacheinander ausgewertet, um möglicherweise allgemeine Einstellungen außer Kraft zu setzen. Die Auswertung stoppt, sobald ein passender Regelsatz gefunden wurde.
es: Puede definir tantos conjuntos de reglas como desee. Se evaluarán una tras otra con el fin de anular los ajustes generales. La evaluación se detiene en cuanto se encuentra un conjunto de reglas coincidente.
fr: Vous pouvez définir autant d'ensembles de règles que vous le souhaitez. Elles seront évaluées l'une après l'autre afin de pouvoir éventuellement remplacer les paramètres généraux. L'évaluation s'arrête dès qu'un ensemble de règles correspondant a été trouvé.
it: È possibile definire tutti i set di regole desiderati. Esse verranno valutate una dopo l'altra per poter eventualmente sovrascrivere le impostazioni generali. La valutazione si interrompe non appena viene trovato un set di regole corrispondente.

# tx_imageautoresize.title
source: Title
da: Titel
de: Titel
es: Título
fr: Titre
it: Titolo

# tx_imageautoresize.usergroup_ruleset
source: User group rule set
da: Brugergruppe regelsæt
de: Regelsatz für Benutzergruppen
es: Conjunto de reglas de grupo de usuarios
fr: Réglages prédéfinis pour des groupes d'utilisateurs
it: Set di regole per gruppi di utenti

# tabs.options
source: Options
da: Tilvalg
de: Optionen
es: Opciones
it: Opzioni

# tabs.rulesets
source: Rule Sets
da: Regelsæt
de: Regelsätze
es: Conjuntos de reglas
fr: Réglages prédéfinis
it: Set di regole
