Repository: xperseguers/t3ext-image_autoresize
Catalog: Resources/Private/Language/*.locallang_csh_tx_imageautoresize.xlf
Languages: da, fr

# directories.description
source: Comma-separated list of directories to be monitored. Example: fileadmin/ Wildcards are supported: fileadmin/*/images/ fileadmin/**/images/
da: Komma-separeret liste af kataloger som skal overvåges. Eksempel: fileadmin/ Jokertegn understøttes: fileadmin/*/billeder/ fileadmin/**/billeder/
fr: Liste (séparateur virgule) de répertoires à gérer. Exemple : fileadmin/ Les astérisques sont supportées : images/ fileadmin/**/images/

# file_types.description
source: Comma-separated list of file types to be handled. Example: jpg,jpeg,png,tif,tiff
da: Komma-separeret liste af filtyper som skal håndteres. Eksempel: jpg,jpeg,png,tif,tiff
fr: liste (séparateur virgule) de types de fichiers à gérer. Exemple: jpg,jpeg,png,tif,tiff

# threshold.description
source: Images with a file size larger than this value will be resized (allowed units: B|K|M).
da: Billeder større end denne værdi vil få ændret størrelse (tilladte enheder: B|K|M).

# max_width.description
source: Images will be resized up to this maximum width.
da: Billeder vil få ændret størrelse op til denne maksimale bredde.
fr: Les images seront redimensionnées avec cette largeur maximum.

# max_height.description
source: Images will be resized up to this maximum height.
da: Billeder vil få ændret størrelse op til denne maksimale højde.
fr: Les images seront redimensionnées avec cette hauteur maximum.

# max_size.description
source: Images will be resized up to this maximum size. Example: 8M (for a maximum image size of 8 megapixels)
da: Billeder vil blive ændret op til denne maksimale størrelse. Eksempel: 8M (for en maksimal billedstørrelse på 8 megapixel)
fr: Les images seront redimensionnées jusqu'à cette taille limite. Exemple : 8M (pour une taille maximale de 8 megapixels)

# auto_orient.description
source: Will try to auto-magically orient image (useful with photos).
da: Vil auto-magisk forsøge at orientere billede (nyttig for fotografier).
fr: Cela tentera d'orienter les image automatiquement (utile pour les photos).

# keep_metadata.description
source: If ticked, IM will not use $GLOBALS['TYPO3_CONF_VARS']['GFX']['im_stripProfileCommand'] and thus, color profile and metadata such as EXIF, IPTC and XMP will be kept.
da: Hvis aktiv, så vil IM ikke anvende $GLOBALS['TYPO3_CONF_VARS']['GFX']['im_stripProfileCommand'] og således bevares farveprofil og metadata så som EXIF, IPTC og XMP.
fr: Si activé, IM n'utilisera pas $GLOBALS['TYPO3_CONF_VARS']['GFX']['im_stripProfileCommand'] et dans ce cas, le profile de couleur et les meta données telles que EXIF, IPTC et XMP seront conservés.

# resize_png_with_alpha.description
source: If ticked, PNG files with an alpha channel will be resized even though the transparency will be lost
da: Hvis valgt, vil PNG-filer med alfa-kanal få ændret størrelsen, selvom tranparency vil gå tabt
fr: Si activé, les fichiers PNG avec un canal alpha seront redimensionnés même si la transparence sera perdue

# conversion_mapping.description
source: Line-separated list of conversion mapping instructions. This lets you automatically convert the type of the image while resizing it. Example: bmp => jpg tif => jpg
da: Linje-separeret liste af konverterings-kortlægningsinstruktioner. Dette lader dig konvertere typen af billede automatisk, mens størrelsen for det ændres. Eksempel: bmp => jpg tif => jpg
fr: Liste à virgule des instructions de mapping de conversion. Cela vous permet de convertir automatiquement le type d'image au moment du redimensionnement. Exemple : bmp => jpg tif => jpg

# rulesets.description
source: You may define as many rule sets as you wish. They will be evaluated one after the other in order to possibly override general settings. The evalutation stops as soon as a matching rule set has been found.
da: Du kan definere så mange regelsæt som du ønsker. De vil blive evalueret en efter en for om muligt, at tilsidesætte generelle indstillinger. Evalueringen stopper så snart et matchende regelsæt bliver fundet.
fr: You pouvez définir autant de paramétrages prédéfinis que souhaité. Ils seront testés les uns après les autres, dans l'ordre, afin de surcharger les paramétrages généraux. L'évaluation stoppe à partir du moment où une correspondance de paramétrage a été trouvée.
